import pandas as pd
import numpy as np

s = pd.Series([1,3,6,np.nan,44,1])

'''
此类型 的 数列  序号 和值构成
0     1.0
1     3.0
2     6.0
3     NaN
4    44.0
5     1.0
dtype: float64


'''
# print(s)

dates = pd.date_range('20190822',periods=6)

'''
DatetimeIndex(['2019-08-22', '2019-08-23', '2019-08-24', '2019-08-25',
               '2019-08-26', '2019-08-27', '2019-08-28', '2019-08-29',
               '2019-08-30'],
              dtype='datetime64[ns]', freq='D')

'''
# print(dates)
# 生成 6行 4列 索引 是datas 列名为 a b c d 的数组
df = pd.DataFrame(np.random.randn(6,4),index=dates,columns=['a','b','c','d'])
# print(df)
'''
                   a         b         c         d
2019-08-22 -0.679124  0.779390  0.381887 -2.503298
2019-08-23  0.214186  0.516916  0.158933 -0.552409
2019-08-24 -1.204132 -0.357532 -0.727649  1.573271
2019-08-25  1.689324 -0.503728  0.737665  0.633818
2019-08-26  0.905568 -0.769559 -0.009676 -0.069570
2019-08-27  1.036438  1.033797 -0.243026 -0.194225

'''
df1 = pd.DataFrame(np.arange(12).reshape(3,4))

'''
默认索引
   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11
'''
# print(df1)


df2 = pd.DataFrame(np.arange(12).reshape(3,4))